#include "sys.h" 
#include "usart.h"     
#include "delay.h"

#include "IO_init.h"

void IO_init()
{
/****************LED1初始化*******************/  
	//RCC->APB2ENR|=1<<2;     //使能PORTA时钟	   	 		   	 
	//GPIOA->CRH&=0XFfF0FFFf; 
	//GPIOA->CRH|=0X00030000; //PA.12 推挽输出   	 
	//GPIOA->ODR|=1<<14;      //PA.12 输出高
/****************LED1初始化*******************/	
	/****************LED1初始化*******************/  
	RCC->APB2ENR|=1<<3;     //使能PORTB时钟	   	 		   	 
	GPIOB->CRH&=0XF00ffFFFf; 
	GPIOB->CRH|=0X03300000; //PB.13.14 推挽输出   	 
	GPIOB->ODR|=3<<13;      //PB.13.14 输出高
/****************LED1初始化*******************/	

/****************控制IO口初始化*******************/
	//RCC->APB2ENR|=1<<2;     //使能PORTA时钟	   	 
	//GPIOA->CRL&=0XFffF0000; 
	//GPIOA->CRL|=0X00003333; //PA.1.2.3.0 推挽输出   	 
	//GPIOA->ODR|=1<<0;      //Pa.0 输出高
	//GPIOA->ODR|=1<<1;      //Pa.1 输出高
	//GPIOA->ODR|=1<<2;      //Pa.2 输出高
	//GPIOA->ODR|=1<<3;      //Pa.3 输出高
/****************控制IO口初始化*******************/	
	
/****************KEY2初始化*******************/
	RCC->APB2ENR|=1<<3;     //使能PORTB时钟	   	 
	GPIOB->CRH&=0X0FFFFFfF; 
	GPIOB->CRH|=0X80000000; //Pb.15 上拉输入    	 
	GPIOB->ODR|=1<<15;      //Pb.15 输出高
/****************KEY2初始化*******************/	
/****************KEY1初始化*******************/
	RCC->APB2ENR|=1<<3;     //使能PORTB时钟	   	 
	GPIOB->CRL&=0XfFFFFF00; 
	GPIOB->CRL|=0X00000088; //Pb.1.0 上拉输入    	 
	GPIOB->ODR|=3<<0;      //Pb.1.0 输出高
/****************KEY1初始化*******************/		
	
/****************KEY、SW初始化*******************/
	//RCC->APB2ENR|=1<<3;     //使能PORTB时钟	   	 
	//GPIOB->CRH&=0XFFFF00FF; 
	//GPIOB->CRH|=0X00008800; //PB.10 PB.11上拉输入   	 
	//GPIOB->ODR|=2<<10;      //PB.10 PB.11 输出高
/****************KEY、SW初始化*******************/
/****************蜂鸣器初始化*******************/
	//RCC->APB2ENR|=1<<3;     //使能PORTB时钟	   	 
	//GPIOB->CRH&=0XFF0FFFFF; 
	//GPIOB->CRH|=0X00300000; //PB.13 推挽输出   	 
	//GPIOB->ODR|=0<<13;      //PB.13 输出低  关闭蜂鸣器
/****************蜂鸣器初始化*******************/
/****************蜂鸣器初始化*******************/
	//RCC->APB2ENR|=1<<3;     //使能PORTB时钟	   	 
	//GPIOB->CRH&=0XFF0FFFFF; 
	//GPIOB->CRH|=0X00300000; //PB.13 推挽输出   	 
	//GPIOB->ODR|=0<<13;      //PB.13 输出低  关闭蜂鸣器
/****************蜂鸣器初始化*******************/
}
